input: "data"
input_dim: 1
input_dim: 3
input_dim: 256
input_dim: 256
layer {
  name: "conv1_3x3_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_3x3_s2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv1_3x3_s2_bn_tr"
  type: "BatchNorm"
  bottom: "conv1_3x3_s2"
  top: "conv1_3x3_s2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv1_3x3_s2_bn"
  type: "BatchNorm"
  bottom: "conv1_3x3_s2"
  top: "conv1_3x3_s2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv1_3x3_s2_relu"
  type: "ReLU"
  bottom: "conv1_3x3_s2"
  top: "conv1_3x3_s2"
}
layer {
  name: "conv2_3x3_s1"
  type: "Convolution"
  bottom: "conv1_3x3_s2"
  top: "conv2_3x3_s1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv2_3x3_s1_bn_tr"
  type: "BatchNorm"
  bottom: "conv2_3x3_s1"
  top: "conv2_3x3_s1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv2_3x3_s1_bn"
  type: "BatchNorm"
  bottom: "conv2_3x3_s1"
  top: "conv2_3x3_s1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv2_3x3_s1_relu"
  type: "ReLU"
  bottom: "conv2_3x3_s1"
  top: "conv2_3x3_s1"
}
layer {
  name: "conv3_3x3_s1"
  type: "Convolution"
  bottom: "conv2_3x3_s1"
  top: "conv3_3x3_s1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv3_3x3_s1_bn_tr"
  type: "BatchNorm"
  bottom: "conv3_3x3_s1"
  top: "conv3_3x3_s1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv3_3x3_s1_bn"
  type: "BatchNorm"
  bottom: "conv3_3x3_s1"
  top: "conv3_3x3_s1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv3_3x3_s1_relu"
  type: "ReLU"
  bottom: "conv3_3x3_s1"
  top: "conv3_3x3_s1"
}
layer {
  name: "inception_stem1_pool"
  type: "Pooling"
  bottom: "conv3_3x3_s1"
  top: "inception_stem1_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_1x1_s1"
  type: "Convolution"
  bottom: "inception_stem1_pool"
  top: "conv4_1x1_s1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 80
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv4_1x1_s1_bn_tr"
  type: "BatchNorm"
  bottom: "conv4_1x1_s1"
  top: "conv4_1x1_s1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv4_1x1_s1_bn"
  type: "BatchNorm"
  bottom: "conv4_1x1_s1"
  top: "conv4_1x1_s1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv4_1x1_s1_relu"
  type: "ReLU"
  bottom: "conv4_1x1_s1"
  top: "conv4_1x1_s1"
}
layer {
  name: "conv5_3x3_s1"
  type: "Convolution"
  bottom: "conv4_1x1_s1"
  top: "conv5_3x3_s1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv5_3x3_s1_bn_tr"
  type: "BatchNorm"
  bottom: "conv5_3x3_s1"
  top: "conv5_3x3_s1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv5_3x3_s1_bn"
  type: "BatchNorm"
  bottom: "conv5_3x3_s1"
  top: "conv5_3x3_s1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv5_3x3_s1_relu"
  type: "ReLU"
  bottom: "conv5_3x3_s1"
  top: "conv5_3x3_s1"
}
layer {
  name: "conv6_3x3_s2"
  type: "Convolution"
  bottom: "conv5_3x3_s1"
  top: "conv6_3x3_s2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv6_3x3_s2_bn_tr"
  type: "BatchNorm"
  bottom: "conv6_3x3_s2"
  top: "conv6_3x3_s2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv6_3x3_s2_bn"
  type: "BatchNorm"
  bottom: "conv6_3x3_s2"
  top: "conv6_3x3_s2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "conv6_3x3_s2_relu"
  type: "ReLU"
  bottom: "conv6_3x3_s2"
  top: "conv6_3x3_s2"
}
layer {
  name: "inception_a1_1x1_b0"
  type: "Convolution"
  bottom: "conv6_3x3_s2"
  top: "inception_a1_1x1_b0"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a1_1x1_b0_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a1_1x1_b0"
  top: "inception_a1_1x1_b0"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_1x1_b0_bn"
  type: "BatchNorm"
  bottom: "inception_a1_1x1_b0"
  top: "inception_a1_1x1_b0"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_1x1_b0_relu"
  type: "ReLU"
  bottom: "inception_a1_1x1_b0"
  top: "inception_a1_1x1_b0"
}
layer {
  name: "inception_a1_1x1_b1"
  type: "Convolution"
  bottom: "conv6_3x3_s2"
  top: "inception_a1_1x1_b1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a1_1x1_b1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a1_1x1_b1"
  top: "inception_a1_1x1_b1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_1x1_b1_bn"
  type: "BatchNorm"
  bottom: "inception_a1_1x1_b1"
  top: "inception_a1_1x1_b1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_1x1_b1_relu"
  type: "ReLU"
  bottom: "inception_a1_1x1_b1"
  top: "inception_a1_1x1_b1"
}
layer {
  name: "inception_a1_3x3_b1"
  type: "Convolution"
  bottom: "inception_a1_1x1_b1"
  top: "inception_a1_3x3_b1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a1_3x3_b1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a1_3x3_b1"
  top: "inception_a1_3x3_b1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_3x3_b1_bn"
  type: "BatchNorm"
  bottom: "inception_a1_3x3_b1"
  top: "inception_a1_3x3_b1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_3x3_b1_relu"
  type: "ReLU"
  bottom: "inception_a1_3x3_b1"
  top: "inception_a1_3x3_b1"
}
layer {
  name: "inception_a1_1x1_b2"
  type: "Convolution"
  bottom: "conv6_3x3_s2"
  top: "inception_a1_1x1_b2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a1_1x1_b2_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a1_1x1_b2"
  top: "inception_a1_1x1_b2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_1x1_b2_bn"
  type: "BatchNorm"
  bottom: "inception_a1_1x1_b2"
  top: "inception_a1_1x1_b2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_1x1_b2_relu"
  type: "ReLU"
  bottom: "inception_a1_1x1_b2"
  top: "inception_a1_1x1_b2"
}
layer {
  name: "inception_a1_3x3_b2"
  type: "Convolution"
  bottom: "inception_a1_1x1_b2"
  top: "inception_a1_3x3_b2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a1_3x3_b2_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a1_3x3_b2"
  top: "inception_a1_3x3_b2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_3x3_b2_bn"
  type: "BatchNorm"
  bottom: "inception_a1_3x3_b2"
  top: "inception_a1_3x3_b2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_3x3_b2_relu"
  type: "ReLU"
  bottom: "inception_a1_3x3_b2"
  top: "inception_a1_3x3_b2"
}
layer {
  name: "inception_a1_3x3_b2_a"
  type: "Convolution"
  bottom: "inception_a1_3x3_b2"
  top: "inception_a1_3x3_b2_a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a1_3x3_b2_a_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a1_3x3_b2_a"
  top: "inception_a1_3x3_b2_a"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_3x3_b2_a_bn"
  type: "BatchNorm"
  bottom: "inception_a1_3x3_b2_a"
  top: "inception_a1_3x3_b2_a"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a1_3x3_b2_a_relu"
  type: "ReLU"
  bottom: "inception_a1_3x3_b2_a"
  top: "inception_a1_3x3_b2_a"
}
layer {
  name: "inception_a1_concat"
  type: "Concat"
  bottom: "inception_a1_1x1_b0"
  bottom: "inception_a1_3x3_b1"
  bottom: "inception_a1_3x3_b2_a"
  top: "inception_a1_concat"
}
layer {
  name: "inception_a1_1x1"
  type: "Convolution"
  bottom: "inception_a1_concat"
  top: "inception_a1_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_a1_scaled"
  type: "Power"
  bottom: "inception_a1_1x1"
  top: "inception_a1_scaled"
  power_param {
    power: 1.0
    scale: 0.170000001788
    shift: 0.0
  }
}
layer {
  name: "inception_a1_output"
  type: "Eltwise"
  bottom: "conv6_3x3_s2"
  bottom: "inception_a1_scaled"
  top: "inception_a1_output"
}
layer {
  name: "inception_a1_output_relu"
  type: "ReLU"
  bottom: "inception_a1_output"
  top: "inception_a1_output"
}
layer {
  name: "inception_a2_1x1_b0"
  type: "Convolution"
  bottom: "inception_a1_output"
  top: "inception_a2_1x1_b0"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a2_1x1_b0_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a2_1x1_b0"
  top: "inception_a2_1x1_b0"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_1x1_b0_bn"
  type: "BatchNorm"
  bottom: "inception_a2_1x1_b0"
  top: "inception_a2_1x1_b0"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_1x1_b0_relu"
  type: "ReLU"
  bottom: "inception_a2_1x1_b0"
  top: "inception_a2_1x1_b0"
}
layer {
  name: "inception_a2_1x1_b1"
  type: "Convolution"
  bottom: "inception_a1_output"
  top: "inception_a2_1x1_b1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a2_1x1_b1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a2_1x1_b1"
  top: "inception_a2_1x1_b1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_1x1_b1_bn"
  type: "BatchNorm"
  bottom: "inception_a2_1x1_b1"
  top: "inception_a2_1x1_b1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_1x1_b1_relu"
  type: "ReLU"
  bottom: "inception_a2_1x1_b1"
  top: "inception_a2_1x1_b1"
}
layer {
  name: "inception_a2_3x3_b1"
  type: "Convolution"
  bottom: "inception_a2_1x1_b1"
  top: "inception_a2_3x3_b1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a2_3x3_b1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a2_3x3_b1"
  top: "inception_a2_3x3_b1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_3x3_b1_bn"
  type: "BatchNorm"
  bottom: "inception_a2_3x3_b1"
  top: "inception_a2_3x3_b1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_3x3_b1_relu"
  type: "ReLU"
  bottom: "inception_a2_3x3_b1"
  top: "inception_a2_3x3_b1"
}
layer {
  name: "inception_a2_1x1_b2"
  type: "Convolution"
  bottom: "inception_a1_output"
  top: "inception_a2_1x1_b2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a2_1x1_b2_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a2_1x1_b2"
  top: "inception_a2_1x1_b2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_1x1_b2_bn"
  type: "BatchNorm"
  bottom: "inception_a2_1x1_b2"
  top: "inception_a2_1x1_b2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_1x1_b2_relu"
  type: "ReLU"
  bottom: "inception_a2_1x1_b2"
  top: "inception_a2_1x1_b2"
}
layer {
  name: "inception_a2_3x3_b2"
  type: "Convolution"
  bottom: "inception_a2_1x1_b2"
  top: "inception_a2_3x3_b2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a2_3x3_b2_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a2_3x3_b2"
  top: "inception_a2_3x3_b2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_3x3_b2_bn"
  type: "BatchNorm"
  bottom: "inception_a2_3x3_b2"
  top: "inception_a2_3x3_b2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_3x3_b2_relu"
  type: "ReLU"
  bottom: "inception_a2_3x3_b2"
  top: "inception_a2_3x3_b2"
}
layer {
  name: "inception_a2_3x3_b2_a"
  type: "Convolution"
  bottom: "inception_a2_3x3_b2"
  top: "inception_a2_3x3_b2_a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a2_3x3_b2_a_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a2_3x3_b2_a"
  top: "inception_a2_3x3_b2_a"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_3x3_b2_a_bn"
  type: "BatchNorm"
  bottom: "inception_a2_3x3_b2_a"
  top: "inception_a2_3x3_b2_a"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a2_3x3_b2_a_relu"
  type: "ReLU"
  bottom: "inception_a2_3x3_b2_a"
  top: "inception_a2_3x3_b2_a"
}
layer {
  name: "inception_a2_concat"
  type: "Concat"
  bottom: "inception_a2_1x1_b0"
  bottom: "inception_a2_3x3_b1"
  bottom: "inception_a2_3x3_b2_a"
  top: "inception_a2_concat"
}
layer {
  name: "inception_a2_1x1"
  type: "Convolution"
  bottom: "inception_a2_concat"
  top: "inception_a2_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_a2_scaled"
  type: "Power"
  bottom: "inception_a2_1x1"
  top: "inception_a2_scaled"
  power_param {
    power: 1.0
    scale: 0.170000001788
    shift: 0.0
  }
}
layer {
  name: "inception_a2_output"
  type: "Eltwise"
  bottom: "inception_a1_output"
  bottom: "inception_a2_scaled"
  top: "inception_a2_output"
}
layer {
  name: "inception_a2_output_relu"
  type: "ReLU"
  bottom: "inception_a2_output"
  top: "inception_a2_output"
}
layer {
  name: "inception_a3_1x1_b0"
  type: "Convolution"
  bottom: "inception_a2_output"
  top: "inception_a3_1x1_b0"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a3_1x1_b0_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a3_1x1_b0"
  top: "inception_a3_1x1_b0"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_1x1_b0_bn"
  type: "BatchNorm"
  bottom: "inception_a3_1x1_b0"
  top: "inception_a3_1x1_b0"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_1x1_b0_relu"
  type: "ReLU"
  bottom: "inception_a3_1x1_b0"
  top: "inception_a3_1x1_b0"
}
layer {
  name: "inception_a3_1x1_b1"
  type: "Convolution"
  bottom: "inception_a2_output"
  top: "inception_a3_1x1_b1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a3_1x1_b1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a3_1x1_b1"
  top: "inception_a3_1x1_b1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_1x1_b1_bn"
  type: "BatchNorm"
  bottom: "inception_a3_1x1_b1"
  top: "inception_a3_1x1_b1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_1x1_b1_relu"
  type: "ReLU"
  bottom: "inception_a3_1x1_b1"
  top: "inception_a3_1x1_b1"
}
layer {
  name: "inception_a3_3x3_b1"
  type: "Convolution"
  bottom: "inception_a3_1x1_b1"
  top: "inception_a3_3x3_b1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a3_3x3_b1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a3_3x3_b1"
  top: "inception_a3_3x3_b1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_3x3_b1_bn"
  type: "BatchNorm"
  bottom: "inception_a3_3x3_b1"
  top: "inception_a3_3x3_b1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_3x3_b1_relu"
  type: "ReLU"
  bottom: "inception_a3_3x3_b1"
  top: "inception_a3_3x3_b1"
}
layer {
  name: "inception_a3_1x1_b2"
  type: "Convolution"
  bottom: "inception_a2_output"
  top: "inception_a3_1x1_b2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a3_1x1_b2_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a3_1x1_b2"
  top: "inception_a3_1x1_b2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_1x1_b2_bn"
  type: "BatchNorm"
  bottom: "inception_a3_1x1_b2"
  top: "inception_a3_1x1_b2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_1x1_b2_relu"
  type: "ReLU"
  bottom: "inception_a3_1x1_b2"
  top: "inception_a3_1x1_b2"
}
layer {
  name: "inception_a3_3x3_b2"
  type: "Convolution"
  bottom: "inception_a3_1x1_b2"
  top: "inception_a3_3x3_b2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a3_3x3_b2_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a3_3x3_b2"
  top: "inception_a3_3x3_b2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_3x3_b2_bn"
  type: "BatchNorm"
  bottom: "inception_a3_3x3_b2"
  top: "inception_a3_3x3_b2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_3x3_b2_relu"
  type: "ReLU"
  bottom: "inception_a3_3x3_b2"
  top: "inception_a3_3x3_b2"
}
layer {
  name: "inception_a3_3x3_b2_a"
  type: "Convolution"
  bottom: "inception_a3_3x3_b2"
  top: "inception_a3_3x3_b2_a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a3_3x3_b2_a_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a3_3x3_b2_a"
  top: "inception_a3_3x3_b2_a"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_3x3_b2_a_bn"
  type: "BatchNorm"
  bottom: "inception_a3_3x3_b2_a"
  top: "inception_a3_3x3_b2_a"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a3_3x3_b2_a_relu"
  type: "ReLU"
  bottom: "inception_a3_3x3_b2_a"
  top: "inception_a3_3x3_b2_a"
}
layer {
  name: "inception_a3_concat"
  type: "Concat"
  bottom: "inception_a3_1x1_b0"
  bottom: "inception_a3_3x3_b1"
  bottom: "inception_a3_3x3_b2_a"
  top: "inception_a3_concat"
}
layer {
  name: "inception_a3_1x1"
  type: "Convolution"
  bottom: "inception_a3_concat"
  top: "inception_a3_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_a3_scaled"
  type: "Power"
  bottom: "inception_a3_1x1"
  top: "inception_a3_scaled"
  power_param {
    power: 1.0
    scale: 0.170000001788
    shift: 0.0
  }
}
layer {
  name: "inception_a3_output"
  type: "Eltwise"
  bottom: "inception_a2_output"
  bottom: "inception_a3_scaled"
  top: "inception_a3_output"
}
layer {
  name: "inception_a3_output_relu"
  type: "ReLU"
  bottom: "inception_a3_output"
  top: "inception_a3_output"
}
layer {
  name: "inception_a4_1x1_b0"
  type: "Convolution"
  bottom: "inception_a3_output"
  top: "inception_a4_1x1_b0"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a4_1x1_b0_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a4_1x1_b0"
  top: "inception_a4_1x1_b0"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_1x1_b0_bn"
  type: "BatchNorm"
  bottom: "inception_a4_1x1_b0"
  top: "inception_a4_1x1_b0"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_1x1_b0_relu"
  type: "ReLU"
  bottom: "inception_a4_1x1_b0"
  top: "inception_a4_1x1_b0"
}
layer {
  name: "inception_a4_1x1_b1"
  type: "Convolution"
  bottom: "inception_a3_output"
  top: "inception_a4_1x1_b1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a4_1x1_b1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a4_1x1_b1"
  top: "inception_a4_1x1_b1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_1x1_b1_bn"
  type: "BatchNorm"
  bottom: "inception_a4_1x1_b1"
  top: "inception_a4_1x1_b1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_1x1_b1_relu"
  type: "ReLU"
  bottom: "inception_a4_1x1_b1"
  top: "inception_a4_1x1_b1"
}
layer {
  name: "inception_a4_3x3_b1"
  type: "Convolution"
  bottom: "inception_a4_1x1_b1"
  top: "inception_a4_3x3_b1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a4_3x3_b1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a4_3x3_b1"
  top: "inception_a4_3x3_b1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_3x3_b1_bn"
  type: "BatchNorm"
  bottom: "inception_a4_3x3_b1"
  top: "inception_a4_3x3_b1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_3x3_b1_relu"
  type: "ReLU"
  bottom: "inception_a4_3x3_b1"
  top: "inception_a4_3x3_b1"
}
layer {
  name: "inception_a4_1x1_b2"
  type: "Convolution"
  bottom: "inception_a3_output"
  top: "inception_a4_1x1_b2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a4_1x1_b2_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a4_1x1_b2"
  top: "inception_a4_1x1_b2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_1x1_b2_bn"
  type: "BatchNorm"
  bottom: "inception_a4_1x1_b2"
  top: "inception_a4_1x1_b2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_1x1_b2_relu"
  type: "ReLU"
  bottom: "inception_a4_1x1_b2"
  top: "inception_a4_1x1_b2"
}
layer {
  name: "inception_a4_3x3_b2"
  type: "Convolution"
  bottom: "inception_a4_1x1_b2"
  top: "inception_a4_3x3_b2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a4_3x3_b2_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a4_3x3_b2"
  top: "inception_a4_3x3_b2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_3x3_b2_bn"
  type: "BatchNorm"
  bottom: "inception_a4_3x3_b2"
  top: "inception_a4_3x3_b2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_3x3_b2_relu"
  type: "ReLU"
  bottom: "inception_a4_3x3_b2"
  top: "inception_a4_3x3_b2"
}
layer {
  name: "inception_a4_3x3_b2_a"
  type: "Convolution"
  bottom: "inception_a4_3x3_b2"
  top: "inception_a4_3x3_b2_a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a4_3x3_b2_a_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a4_3x3_b2_a"
  top: "inception_a4_3x3_b2_a"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_3x3_b2_a_bn"
  type: "BatchNorm"
  bottom: "inception_a4_3x3_b2_a"
  top: "inception_a4_3x3_b2_a"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a4_3x3_b2_a_relu"
  type: "ReLU"
  bottom: "inception_a4_3x3_b2_a"
  top: "inception_a4_3x3_b2_a"
}
layer {
  name: "inception_a4_concat"
  type: "Concat"
  bottom: "inception_a4_1x1_b0"
  bottom: "inception_a4_3x3_b1"
  bottom: "inception_a4_3x3_b2_a"
  top: "inception_a4_concat"
}
layer {
  name: "inception_a4_1x1"
  type: "Convolution"
  bottom: "inception_a4_concat"
  top: "inception_a4_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_a4_scaled"
  type: "Power"
  bottom: "inception_a4_1x1"
  top: "inception_a4_scaled"
  power_param {
    power: 1.0
    scale: 0.170000001788
    shift: 0.0
  }
}
layer {
  name: "inception_a4_output"
  type: "Eltwise"
  bottom: "inception_a3_output"
  bottom: "inception_a4_scaled"
  top: "inception_a4_output"
}
layer {
  name: "inception_a4_output_relu"
  type: "ReLU"
  bottom: "inception_a4_output"
  top: "inception_a4_output"
}
layer {
  name: "inception_a5_1x1_b0"
  type: "Convolution"
  bottom: "inception_a4_output"
  top: "inception_a5_1x1_b0"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a5_1x1_b0_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a5_1x1_b0"
  top: "inception_a5_1x1_b0"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_1x1_b0_bn"
  type: "BatchNorm"
  bottom: "inception_a5_1x1_b0"
  top: "inception_a5_1x1_b0"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_1x1_b0_relu"
  type: "ReLU"
  bottom: "inception_a5_1x1_b0"
  top: "inception_a5_1x1_b0"
}
layer {
  name: "inception_a5_1x1_b1"
  type: "Convolution"
  bottom: "inception_a4_output"
  top: "inception_a5_1x1_b1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a5_1x1_b1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a5_1x1_b1"
  top: "inception_a5_1x1_b1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_1x1_b1_bn"
  type: "BatchNorm"
  bottom: "inception_a5_1x1_b1"
  top: "inception_a5_1x1_b1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_1x1_b1_relu"
  type: "ReLU"
  bottom: "inception_a5_1x1_b1"
  top: "inception_a5_1x1_b1"
}
layer {
  name: "inception_a5_3x3_b1"
  type: "Convolution"
  bottom: "inception_a5_1x1_b1"
  top: "inception_a5_3x3_b1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a5_3x3_b1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a5_3x3_b1"
  top: "inception_a5_3x3_b1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_3x3_b1_bn"
  type: "BatchNorm"
  bottom: "inception_a5_3x3_b1"
  top: "inception_a5_3x3_b1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_3x3_b1_relu"
  type: "ReLU"
  bottom: "inception_a5_3x3_b1"
  top: "inception_a5_3x3_b1"
}
layer {
  name: "inception_a5_1x1_b2"
  type: "Convolution"
  bottom: "inception_a4_output"
  top: "inception_a5_1x1_b2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a5_1x1_b2_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a5_1x1_b2"
  top: "inception_a5_1x1_b2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_1x1_b2_bn"
  type: "BatchNorm"
  bottom: "inception_a5_1x1_b2"
  top: "inception_a5_1x1_b2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_1x1_b2_relu"
  type: "ReLU"
  bottom: "inception_a5_1x1_b2"
  top: "inception_a5_1x1_b2"
}
layer {
  name: "inception_a5_3x3_b2"
  type: "Convolution"
  bottom: "inception_a5_1x1_b2"
  top: "inception_a5_3x3_b2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a5_3x3_b2_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a5_3x3_b2"
  top: "inception_a5_3x3_b2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_3x3_b2_bn"
  type: "BatchNorm"
  bottom: "inception_a5_3x3_b2"
  top: "inception_a5_3x3_b2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_3x3_b2_relu"
  type: "ReLU"
  bottom: "inception_a5_3x3_b2"
  top: "inception_a5_3x3_b2"
}
layer {
  name: "inception_a5_3x3_b2_a"
  type: "Convolution"
  bottom: "inception_a5_3x3_b2"
  top: "inception_a5_3x3_b2_a"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_a5_3x3_b2_a_bn_tr"
  type: "BatchNorm"
  bottom: "inception_a5_3x3_b2_a"
  top: "inception_a5_3x3_b2_a"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_3x3_b2_a_bn"
  type: "BatchNorm"
  bottom: "inception_a5_3x3_b2_a"
  top: "inception_a5_3x3_b2_a"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_a5_3x3_b2_a_relu"
  type: "ReLU"
  bottom: "inception_a5_3x3_b2_a"
  top: "inception_a5_3x3_b2_a"
}
layer {
  name: "inception_a5_concat"
  type: "Concat"
  bottom: "inception_a5_1x1_b0"
  bottom: "inception_a5_3x3_b1"
  bottom: "inception_a5_3x3_b2_a"
  top: "inception_a5_concat"
}
layer {
  name: "inception_a5_1x1"
  type: "Convolution"
  bottom: "inception_a5_concat"
  top: "inception_a5_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_a5_scaled"
  type: "Power"
  bottom: "inception_a5_1x1"
  top: "inception_a5_scaled"
  power_param {
    power: 1.0
    scale: 0.170000001788
    shift: 0.0
  }
}
layer {
  name: "inception_a5_output"
  type: "Eltwise"
  bottom: "inception_a4_output"
  bottom: "inception_a5_scaled"
  top: "inception_a5_output"
}
layer {
  name: "inception_a5_output_relu"
  type: "ReLU"
  bottom: "inception_a5_output"
  top: "inception_a5_output"
}
layer {
  name: "reduction_a_conv_3x3"
  type: "Convolution"
  bottom: "inception_a5_output"
  top: "reduction_a_conv_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "reduction_a_conv_3x3_bn_tr"
  type: "BatchNorm"
  bottom: "reduction_a_conv_3x3"
  top: "reduction_a_conv_3x3"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "reduction_a_conv_3x3_bn"
  type: "BatchNorm"
  bottom: "reduction_a_conv_3x3"
  top: "reduction_a_conv_3x3"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "reduction_a_conv_3x3_relu"
  type: "ReLU"
  bottom: "reduction_a_conv_3x3"
  top: "reduction_a_conv_3x3"
}
layer {
  name: "reduction_a_conv_1x1_reduce"
  type: "Convolution"
  bottom: "inception_a5_output"
  top: "reduction_a_conv_1x1_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "reduction_a_conv_1x1_reduce_bn_tr"
  type: "BatchNorm"
  bottom: "reduction_a_conv_1x1_reduce"
  top: "reduction_a_conv_1x1_reduce"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "reduction_a_conv_1x1_reduce_bn"
  type: "BatchNorm"
  bottom: "reduction_a_conv_1x1_reduce"
  top: "reduction_a_conv_1x1_reduce"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "reduction_a_conv_1x1_reduce_relu"
  type: "ReLU"
  bottom: "reduction_a_conv_1x1_reduce"
  top: "reduction_a_conv_1x1_reduce"
}
layer {
  name: "reduction_a_conv_3x3_2"
  type: "Convolution"
  bottom: "reduction_a_conv_1x1_reduce"
  top: "reduction_a_conv_3x3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "reduction_a_conv_3x3_2_bn_tr"
  type: "BatchNorm"
  bottom: "reduction_a_conv_3x3_2"
  top: "reduction_a_conv_3x3_2"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "reduction_a_conv_3x3_2_bn"
  type: "BatchNorm"
  bottom: "reduction_a_conv_3x3_2"
  top: "reduction_a_conv_3x3_2"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "reduction_a_conv_3x3_2_relu"
  type: "ReLU"
  bottom: "reduction_a_conv_3x3_2"
  top: "reduction_a_conv_3x3_2"
}
layer {
  name: "reduction_a_conv_3x3_3"
  type: "Convolution"
  bottom: "reduction_a_conv_3x3_2"
  top: "reduction_a_conv_3x3_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "reduction_a_conv_3x3_3_bn_tr"
  type: "BatchNorm"
  bottom: "reduction_a_conv_3x3_3"
  top: "reduction_a_conv_3x3_3"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "reduction_a_conv_3x3_3_bn"
  type: "BatchNorm"
  bottom: "reduction_a_conv_3x3_3"
  top: "reduction_a_conv_3x3_3"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "reduction_a_conv_3x3_3_relu"
  type: "ReLU"
  bottom: "reduction_a_conv_3x3_3"
  top: "reduction_a_conv_3x3_3"
}
layer {
  name: "reduction_a_pool"
  type: "Pooling"
  bottom: "inception_a5_output"
  top: "reduction_a_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "reduction_a_concat"
  type: "Concat"
  bottom: "reduction_a_conv_3x3"
  bottom: "reduction_a_conv_3x3_3"
  bottom: "reduction_a_pool"
  top: "reduction_a_concat"
}
layer {
  name: "inception_b1_1x1"
  type: "Convolution"
  bottom: "reduction_a_concat"
  top: "inception_b1_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "inception_b1_1x1_bn_tr"
  type: "BatchNorm"
  bottom: "inception_b1_1x1"
  top: "inception_b1_1x1"
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_b1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_b1_1x1"
  top: "inception_b1_1x1"
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.995000004768
    eps: 9.99999974738e-06
  }
}
layer {
  name: "inception_b1_1x1_relu"
  type: "ReLU"
  bottom: "inception_b1_1x1"
  top: "inception_b1_1x1"
}
layer {
  name: "inception_b1_1x7_2_reduce"
  type: "Convolution"
  bottom: "reduction_a_concat"
  top: "inception_b1_1x7_2_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
